app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `post`, `address`, `user_id`, `created_at`, `updated_at`, `price`) VALUES ('testpost', 'ggjhjhjhj', '111', 1, '2016-11-15 02:15:17', '2016-11-15 02:15:17', -1)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save