app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email:params[:session][:email], password:params[:session][:password])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'test.user1@sjsu.edu' AND `users`.`password` = 'password' LIMIT 1