app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`password`, `email`, `firstname`, `lastname`, `created_at`, `updated_at`) VALUES ('temppass', 'hridayam', 'hridayam', 'bakshi', '2016-11-15 02:09:35', '2016-11-15 02:09:35')